netbsd-pint/lprlpd/src/lpd/lpd.8
.\"	$NetBSD: lpd.8,v 1.35 2011/11/09 14:16:00 wiz Exp $
.\"
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)lpd.8	8.3 (Berkeley) 4/19/94
.\"
.Dd May 30, 2017
.Dt LPD 8
.Os
.Sh NAME
.Nm lpd
.Nd line printer spooler daemon
.Sh SYNOPSIS
.Nm
.Op Fl dlsrW
.Op Fl b Ar bind-address
.Op Fl I Ar ipp-port
.Op Fl L Ar lpr-port
.Op Fl m Ar minfree
.Op Fl n Ar maxthreads
.Op Fl w Ar maxwait
.Sh DESCRIPTION
.Nm
is the line printer daemon (spool area handler) and is normally invoked
at boot time from the
.Xr rc 8
file.
It makes a single pass through the
.Xr printcap 5
file to find out about the existing printers and prints any files
left after a crash.
It then uses the system calls
.Xr listen 2
and
.Xr accept 2
to receive requests to print files in the queue, transfer files to
the spooling area, display the queue, or remove jobs from the queue.
In each case, it assigns a job to a thread to handle the request so the
control thread can continue to listen for more requests.
.Pp
Available options:
.Bl -tag -width Ds
.It Fl b
Normally, if the
.Fl s
option is not specified,
.Nm
will listen on all network interfaces for incoming TCP connections.
The
.Fl b
option, followed by a
.Ar bind-address
specifies that
.Nm
should listen on that address instead of INADDR_ANY.
Multiple
.Fl b
options are permitted, allowing a list of addresses to be specified.
Use of this option silently overrides the
.Fl s
option if it is also present on the command line.
.Ar bind-address
can be a numeric host name in IPv4 or IPv6 notation, or a symbolic host
name which will be looked up in the normal way.
.It Fl d
The
.Fl d
option turns on the
.Dv SO_DEBUG
.Xr socket 2
option.
See
.Xr setsockopt 2
for more details.
.It Fl I
The
.Fl I
flag specifies
.Ar ipp-port
as the port to listen on for incoming IPP protocol connections.
The default is port 631.
.It Fl l
The
.Fl l
flag causes
.Nm
to log valid requests received from the network.
This can be useful for debugging purposes.
.It Fl L
The
.Fl L
flag specifies
.Ar lpr-port
as the port to listen on for incoming LPR protocol connections.
The default is port 515.
.It Fl m
The
.Fl m
flag sets
.Ar minfree
as the minimum number of disk blocks to leave free so that the
queue won't completely fill the disk.
It defaults to 1 block.
.It Fl n
The
.Fl n
flag sets
.Ar maxthreads
as the maximum number of threads that
.Nm
will spawn to be used in the thread pool.
The default is 32.
.It Fl r
The
.Fl r
flag allows the
.Dq of
and
.Dq if
filters to be used if specified for a remote
printer.
Traditionally,
.Nm
would not use filters for remote printers.
.It Fl s
The
.Fl s
flag selects
.Dq secure
mode, in which
.Nm
does not listen on a TCP socket but only takes commands from a
.Ux
domain socket.
This is valuable when the machine on which
.Nm
runs is subject to attack over the network and it is desired that the
machine be protected from attempts to remotely fill spools and similar
attacks.
.It Fl w
The
.Fl w
flag sets
.Ar maxwait
as the wait time (in seconds) for dead remote server detection.
If no response is returned from a connected server within this period,
the connection is closed and a message logged.
The default is 120 seconds.
.It Fl W
The
.Fl W
option will instruct lpd not to verify a remote tcp connection
comes from a reserved port (\*[Lt]1024).
.El
.Pp
Access control is provided by three means.
First,
.Pa /etc/hosts.allow
and
.Pa /etc/hosts.deny
are consulted as described in
.Xr hosts_access 5
with daemon name
.Nm .
Second, all requests must come from one of the machines listed in
the file
.Pa /etc/hosts.equiv
or
.Pa /etc/hosts.lpd
unless there is a line consisting of
.Sq + ,
in which case any host
will be accepted that passes the
.Xr hosts_access 5
test and has reverse resolving set up.
Lastly, if the
.Li rs
capability is specified in the
.Xr printcap 5
entry for the printer being accessed,
.Em lpr
requests will only be honored for those users with accounts on the
machine with the printer.
Requests must pass all three tests.
.Sh FILES
.Bl -tag -width "/var/spool/output/*" -compact
.It Pa /etc/printcap
printer description file
.It Pa /var/spool/output/*
spool directories
.It Pa /dev/lp*
line printer devices
.It Pa /var/run/printer
socket for local requests
.It Pa /etc/hosts.allow
explicit remote host access list.
.It Pa /etc/hosts.deny
explicit remote host denial of service list.
.It Pa /etc/hosts.equiv
lists machine names allowed printer access
.It Pa /etc/hosts.lpd
lists machine names allowed printer access,
but not under same administrative control.
.El
.Sh SEE ALSO
.Xr lpq 1 ,
.Xr lpr 1 ,
.Xr lprm 1 ,
.Xr setsockopt 2 ,
.Xr syslog 3 ,
.Xr hosts.equiv 5 ,
.Xr hosts_access 5 ,
.Xr hosts_options 5 ,
.Xr printcap 5 ,
.Xr lpc 8 ,
.Xr pac 8
.Rs
.%T "4.3 BSD Line Printer Spooler Manual"
.Re
.Sh HISTORY
An
.Nm
daemon appeared in Version 6 AT\*[Am]T UNIX.
The
.Nm
daemon received a complete rewrite in NetBSD 7.1 adding IPP support as
well switching to a thread pool model instead of forking. 
